// 1. Створіть обєкт та масив
// * Використовуйте обєкт і масив створені в першому заданні у всіх наступних завданнях
let misha1 = ['name','age','surname'];
let misha = {"name": "Mykhail","surname":"hrab","head":"one","hand1":"left","hand2":"right"};

// 2. Додайте до обєкту ключ "birthdate" типу Date
let misha1 = {
    birthday: new Date (1990, 07, 16)
 };
// 3. Додайте новий елемент в кінець масиву
misha1.push('18kg');
// похудав

// 4. Видаліть з обєкту доданий ключ у завданні 3
misha1.pop();

// 5. Видаліть елемент з масиву доданий у завданні 4
misha1.pop();

// 6. Додайте до обєкту метод який буде виводити ваше імя і прізвище.


// 7. Створіть конструктор який буде відтворювати функціонал який є наявний в обєкті

// 8. Створіть новий конструктор який буде унаслідувати функціонал конструктору з попереднього звдання і буде мати додатковий метод для виводу дати народження.

// 9. Створіть новий eлемент за допомогою конструктору з попереднього завдання і виведіть імя та прізвище або дату народження.