// 1. Використовуючи цикл "while" виведіть в консоль цифри від 0 до 10;
// * Зробіть те саме за допомогою циклу "do while" i "for"
let i = 0;
while(i <=10){
    console.log(i);
    ++i;
};
let i = 0;
// do while
do{
    console.log(i);
    ++i;
}while(i <= 10);
// for
for ( let i = 0; i <= 10; ++i){
    console.log(i);
};


// 2. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   console.log(i);
//   ++i;
// }
//underfined тому що умова не виконується

// 3. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// do {
//   console.log(i);
//   ++i;
// } while (i < 10)
// Відповідь 9

// 4. Замініть цей приклад використовуючи "while"
//
// for (let i = 0; i < 10; i++) {
//   console.log('i', i);
// }
let i = 0;
while(i < 10){
    console.log('i',i)
    i++;
};


// 5. Яке перше значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   ++i;
//   console.log(i);
// }
//underfined тому що умова не виконується


// 6. Яке перше значення буде виведено в консоль?
// let i = 1;
//
// do {
//   i++;
//   console.log(i);
// } while (i < 10)
// Відповідь 2 тому що,спочатку додало +1, а потім вже вивело