// 1. Створіть дві змінні типу стрінг і виведіть їх в консоль разом, використовуючи конкатинацію стрiнги.
let name  = 'Misha';
let lastname = 'Hrab';
console.log(`${name} ${lastname}`)

// 2. Створіть змінну типу стрінг і виведіть в консоль її довжину.
let name = 'Misha';
console.log(name.length);

// 3. Створіть змінну типу стрінг і виведіть в консоль перший символ стрінги.
let name = 'Misha';
console.log(name[0]);

// 4. Створіть змінну типу стрінг і виведіть в консоль останній символ, довільної стрінги.
let name = 'Misha';
console.log(name[name.length -1]);

// 5. Створіть змінну типу стрінг і приведіть змінну до верхнього регістру.
let name = 'Misha';
name.toUpperCase(); 

// 6. Створіть змінну типу стрінг і приведіть змінну до нижнього регістру.
let name = 'Misha';
name.toLowerCase();

// 7. Створіть змінну і присвойте в неї дату вашого народження.
let Misha = {
   birthday: new Date (1990, 07, 16)
};
// 8. Виведіть рік вашого народження (Використовуючи змінну з 7 завдання).
Misha.birthday.getFullYear();

// 9. Виведіть місяць вашого народження (Використовуючи змінну з 7 завдання).
Misha.birthday.getMonth();

// 10. Виведіть день вашого народження (Використовуючи змінну з 7 завдання).
Misha.birthday.getDate();
// 11. Виведіть в консоль рік місяць день вашого народження через тире (-) (Використовуючи змінну з 7 завдання).
console.log(Misha.birthday);// лиш так зміг вивести
// 12. Створіть нову дату яка має 14 годину і 23 хвилини.
let date = new Date (2020, 04, 15, 14, 23, 0);

// 13. Порівняйте дві дати між собою і результат виведіть в консоль.